In [14]:
import pandas as pd

In [15]:
import numpy as np

In [16]:
selloutData = pd.read_csv("C:../dataset/kopo_channel_seasonality_new.csv")

In [17]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [18]:
selloutData["NEW_QTY"] = np.where(selloutData["QTY"] < 0,0,selloutData["QTY"] )

In [20]:
selloutData[selloutData.QTY >= 0].head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY
0      A60   PRODUCT4    201402     71.0     71.0
1      A60  PRODUCT59    201402  22275.0  22275.0
2      A60  PRODUCT34    201402   4463.0   4463.0
3      A60  PRODUCT47    201402      0.0      0.0
4      A60  PRODUCT56    201402     23.0     23.0

## 53 주차 제거

In [74]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
NEW_QTY     float64
WEEK          int64
YEAR          int32
dtype: object

In [75]:
int(201623/100)

2016

In [76]:
201623%100

23

In [105]:
def customFunction(inputColumn):
#     inputColumn = 201601
    yearValue = inputColumn/100 
    yearValue = int(yearValue)
    return yearValue

In [106]:
selloutData["YEAR"] = selloutData["YEARWEEK"].apply(customFunction)

In [107]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [108]:
def customFunction(inputColumn):

    return inputColumn//100

In [109]:
selloutData["YEAR"] = selloutData["YEARWEEK"].apply(customFunction)
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [95]:
이런방법이 = selloutData.YEARWEEK//100  ##  // 하면 몫만 가져옴

In [110]:
이런방법이.head()

0    2014
1    2014
2    2014
3    2014
4    2014
Name: YEARWEEK, dtype: int64

In [80]:
selloutData["WEEK"] = selloutData["YEARWEEK"]%100

In [81]:
selloutData["YEAR"] = (selloutData.YEARWEEK/100).astype(int)

In [112]:
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [113]:
refinedData = selloutData[selloutData.YEARWEEK % 100 <= 53]

In [114]:
refinedData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [117]:
sortKey = ["REGIONID" , "PRODUCT", "YEARWEEK"]

In [118]:
sortedData = refinedData.sort_values(sortKey)

In [119]:
sortedData.head()

     REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK  YEAR
298       A00  PRODUCT34    201401  661.0    661.0     1  2014
1757      A00  PRODUCT34    201402  679.0    679.0     2  2014
3125      A00  PRODUCT34    201403  578.0    578.0     3  2014
205       A00  PRODUCT34    201404  532.0    532.0     4  2014
4369      A00  PRODUCT34    201405  516.0    516.0     5  2014

In [120]:
step1Data = sortedData.reset_index()